{"Preview":{"NASA's Mars 2020 Rover Closer to Getting Its Name":"155 students from across the U.S. have been chosen as semifinalists in NASA's essay contest to name the Mars 2020 rover, and see it launch from Cape Canaveral this July.","Nine Finalists Chosen in NASA's Mars 2020 Rover Naming Contest":"Nine finalists have been chosen in the essay contest for K-12 students across U.S. to name NASA's next Mars rover. Now you can help by voting for your favorite. ","NASA's Mars Helicopter Attached to Mars 2020 Rover ":"The helicopter will be first aircraft to perform flight tests on another planet.","From JPL's Mailroom to Mars and Beyond":"Bill Allen has thrived as the mechanical systems design lead for three Mars rover missions, but he got his start as a teenager sorting letters for the NASA center.","How NASA's Mars Helicopter Will Reach the Red Planet's Surface":"The small craft will seek to prove that powered, controlled flight is possible on another planet. But just getting it onto the surface of Mars will take a whole lot of ingenuity.","NASA's Curiosity Rover Finds an Ancient Oasis on Mars":"New evidence suggests salty, shallow ponds once dotted a Martian crater — a sign of the planet's drying climate.","3 Things We've Learned From NASA's Mars InSight ":"Scientists are finding new mysteries since the geophysics mission landed two years ago.","NASA, ULA Launch Mars 2020 Perseverance Rover Mission to Red Planet":"The agency's Mars 2020 mission is on its way. It will land at Jezero Crater in about seven months, on Feb. 18, 2021. ","NASA's Curiosity Mars Rover Snaps Its Highest-Resolution Panorama Yet":"To go along with the stunning 1.8-billion-pixel image, a new video offers a sweeping view of the Red Planet.","Celebrate Mars Reconnaissance Orbiter's Views From Above":"Marking its 15th anniversary since launch, one of the oldest spacecraft at the Red Planet has provided glimpses of dust devils, avalanches, and more.","NASA's Mars Rover Drivers Need Your Help":"Using an online tool to label Martian terrain types, you can train an artificial intelligence algorithm that could improve the way engineers guide the Curiosity rover.","A Year of Surprising Science From NASA's InSight Mars Mission":"A batch of new papers summarizes the lander's findings above and below the surface of the Red Planet.","NASA's Perseverance Rover 100 Days Out":"Mark your calendars: The agency's latest rover has only about 8,640,000 seconds to go before it touches down on the Red Planet, becoming history's next Mars car.","Join NASA for the Launch of the Mars 2020 Perseverance Rover":"No matter where you live, choose from a menu of activities to join NASA as we \"Countdown to Mars\" and launch the Perseverance rover to the Red Planet.","My Culture, My Voice":"In honor of Hispanic Heritage Month, Christina Hernandez, an instrument engineer on the Mars 2020 mission, talks about her childhood and journey to NASA."}}